df = read.csv("hw1_data.csv")

# ------- 1 -------
# Які назви стовпців файлу даних?
names(df)

# ------- 2 -------
# Виведіть перші 6 строк фрейму даних.
df[1:6,]

# ------- 3 -------
# Скільки спостерігань (строк) в дата фреймі?
nrow(df)

# ------- 4 -------
# Виведіть останні 10 строк дата фрейму.
tail(df,10)

# ------- 5 -------
# Як багато значень «NA» в стовпці «Ozone»?
sum(is.na(df$'Ozone'))

# ------- 6 -------
# Яке середнє (mean) стовпця «Ozone». Виключити «NA» значення.
mean(df$'Ozone',na.rm=TRUE)

# ------- 7 -------
# Виведіть частину набору даних (subset) зі значенням «Ozone» > 31 та «Temp» > 90. 
#Яке середнє (mean) значень «Solar.R» в цьому наборі даних (subset)?
my_sub = subset(df, df$'Ozone' > 31 & df$'Temp' > 90)
mean(my_sub$'Solar.R')

# ------- 8 -------
# Яке середнє значення (mean) для «Temp» для червня («Month» дорівнює 6)?
dbjune = subset(df, df$'Month' == 6)
mean(dbjune$'Temp')

# ------- 9 -------
# Яке максимальне значення «Ozone» для травня («Month» дорівнює 5)?
dbmay = subset(df,df$'Month' == 5)
max(dbmay$'Ozone',na.rm=TRUE)